examples/script-overrides/test.yaml
config:
  target: http://asciiart.artillery.io:8080
  environments:
    # Informal short run:
    smoke:
      phases:
        - arrivalRate: 1
          duration: 10
    # Long-running job:
    preprod:
      phases:
        - arrivalRate: 5
          duration: 20
    dynamic:
      phases:
        - arrivalRate: "{{ $processEnvironment.ARRIVAL_RATE }}"
          duration: "{{ $processEnvironment.DURATION }}"
scenarios:
  - flow:
      - get:
          url: "/"